src/Documents/МаршрутноеЗадание/МаршрутноеЗадание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутноеЗадание</name>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Заказчики</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Перевозчики</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаявкиНаПеревозку</name>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.ЗаявкаНаПеревозку</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктПогрузки</name>
      <type>
        <types>CatalogRef.ТочкиМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктРазгрузки</name>
      <type>
        <types>CatalogRef.ТочкиМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидГруза</name>
      <type>
        <types>CatalogRef.ВидыГрузов</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ЗаявкаНаПеревозку/ЗаявкаНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаПеревозку</name>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Заказчики</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидГруза</name>
    <type>
      <types>CatalogRef.ВидыГрузов</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПунктПогрузки</name>
    <type>
      <types>CatalogRef.ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктРазгрузки</name>
    <type>
      <types>CatalogRef.ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокНаПеревозку</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/МаршрутноеЗадание/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Объект.ОбщийВес = Объект.ЗаявкиНаПеревозку.Итог("Вес");
	Объект.ОбщийОбъем = Объект.ЗаявкиНаПеревозку.Итог("Объем");
	
КонецПроцедуры

&НаСервере
Функция ОбработатьДанныеСтрокиНаСервере(ДанныеСтроки)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заявка", ДанныеСтроки.Заявка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаПеревозку.ВидГруза КАК ВидГруза,
	|	ЗаявкаНаПеревозку.Объем КАК Объем,
	|	ЗаявкаНаПеревозку.Вес КАК Вес,
	|	ЗаявкаНаПеревозку.ПунктПогрузки КАК ПунктПогрузки,
	|	ЗаявкаНаПеревозку.ПунктРазгрузки КАК ПунктРазгрузки,
	|	ЗаявкаНаПеревозку.Статус КАК Статус
	|ИЗ
	|	Документ.ЗаявкаНаПеревозку КАК ЗаявкаНаПеревозку
	|ГДЕ
	|	ЗаявкаНаПеревозку.Ссылка = &Заявка";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеСтроки, Выборка);
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ЗаявкиНаПеревозкуЗаявкаПриИзменении(Элемент)
	
	СтрокаДок = ЭтаФорма.Элементы.ЗаявкиНаПеревозку.ТекущиеДанные;
	ДанныеСтроки = Новый Структура("Заявка,ПунктПогрузки,ПунктРазгрузки,ВидГруза,Объем,Вес,Статус");
	ЗаполнитьЗначенияСвойств(ДанныеСтроки, СтрокаДок);
	ОбработатьДанныеСтрокиНаСервере(ДанныеСтроки);
	ЗаполнитьЗначенияСвойств(СтрокаДок, ДанныеСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСтатусыЗаявок();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусыЗаявок()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивЗаявок", Объект.ЗаявкиНаПеревозку.Выгрузить(, "Заявка").ВыгрузитьКолонку("Заявка"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаПеревозку.Ссылка КАК Заявка,
	|	ЗаявкаНаПеревозку.Статус КАК Статус
	|ИЗ
	|	Документ.ЗаявкаНаПеревозку КАК ЗаявкаНаПеревозку
	|ГДЕ
	|	ЗаявкаНаПеревозку.Ссылка В(&МассивЗаявок)";
	Выборка = Запрос.Выполнить().Выбрать();
	Для Каждого СтрокаТаблицы Из Объект.ЗаявкиНаПеревозку Цикл
		Выборка.Сбросить();
		Если Выборка.НайтиСледующий(Новый Структура("Заявка", СтрокаТаблицы.Заявка)) Тогда
			СтрокаТаблицы.Статус = Выборка.Статус;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьСтатусыЗаявок();
КонецПроцедуры
